app/views/users/show.html.erb

<%= link_to 'Edit', edit_user_registration_path %>
<%=current_user.items.each do |item| %>
---
SELECT "items".* FROM "items" INNER JOIN "inventories" ON "items"."id" = "inventories"."item_id" WHERE "inventories"."user_id" = ?  [["user_id", 4]]