app/controllers/items_controller.rb

  def create
    @item = Item.new(item_params)
    respond_to do |format|
      if @item.save
---
INSERT INTO "items" ("name", "brand", "rating", "user_id", "category_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["name", "Lipstick in Violet"], ["brand", "Smashbox"], ["rating", 4], ["user_id", 1], ["category_id", 0], ["created_at", "2015-09-05 14:22:40.359659"], ["updated_at", "2015-09-05 14:22:40.359659"]]